package com.hillel.lesson6.homework;

/* Необходимо записать любое четверостишие в файл и считать.
Условия:
 о Директории, в которую будет запись файла, может изначально не существовать. Необходимо это учесть;
 о Файл соответственно должен создаваться при записи;
 о После записи необходимо проверить все ли записалось и вывести сообщение об успешной записи;
 о В завершение необходимо считать стих из созданного файла и вывести в консоль.*/

public class Task2 {
    public static void main(String[] args) {




    }
}
