package com.hillel.lesson9.homework;

/*Task: (Выполнить одним  решением  задачи без разбиения на пункты)

·  Создайте класс User, у которого будет несколько полей(имя, фамилия, почта, пароль, пол, страна). Соблюдая принципы инкапсуляции реализуйте в нем все необходимые методы/конструкторы для дальнейшей работы.

·  Так же у данного класса должно быть 2 метода:
а). Читать. Принимает текст, ничего не возвращает, выводит сообщение принятое в консоль. Данный метод необходимо задать как “неизменяемый”.
б). Писать. Ничего не принимает, просто считывает текст с клавиатуры и сохраняет введенный текст в файл.

·  Создать 2 Класса-наследника от User: Support & Admin. Данные классы должны быть заданы,
как классы от которых невозможно больше наследоваться. Так же для этих классов необходимо определить
все необходимые базовые методы для дальнейшей работы.

·  У класса Support определить дополнительный метод-проверки строки.
Этот метод должен на вход принимать строку и проверять наличие этой строки в файле.
Обратно возвращать значение “содержит/не содержит”(подумайте какая переменная лучше всего подходит для данного типа)

·  У класса Admin реализовать другой метод-удаления. Данный метод на вход получает значение
“содержит/ не содержит” и в зависимости от этого значения удаляет файл(если содержит).

·  Далее имея все необходимые классы, зная принцип “динамической диспетчеризации методов” и команду “instanceof”
создайте метод, который будет принимать на вход User(какого-то) и в зависимости от типа вызывать методы:
User = написать строку
Support = написать строку + проверить наличие этой строки в файле
Admin = написать строку + проверить + удалить файл, если такая строка найдена.*/

public class User {
}
