package com.hillel.lesson2.homework;

import com.sun.xml.internal.bind.v2.TODO;

public class Task4 {
    public static void main(String[] args) {
        /**
         * 4)   Создавать  комментарии всех рассмотренных  видов хотя бы по одному примеру;
         * И тут же сразу первый тип комментария: комментарий для документирования.
         * Кажется мы его не рассматривали?!
         * Никогда ранее не пробовал его писать)
         */

//        TODO: добавить блочный и строчный комментарий.

//        Строчный комментарий.

        /*Блочный комментарий.
        Когда нам нужно закоментить какой-то поределенный кусок кода
        и чтобы не коментировать/разкоментировать каждую строку отдельно.*/



    }
}
